Revit 2027 API
ViewPrintingEventArgs Class
 The event arguments used by the ViewPrinting event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ViewPrintingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewPrintingEventArgs : RevitAPIPreDocEventArgs
Public Class ViewPrintingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ViewPrintingEventArgs : public RevitAPIPreDocEventArgs
type ViewPrintingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ViewPrintingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPreDocEventArgs)
Index |  The index of the view being printed out of the set of all views being printed.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
TotalViews |  The number of all views being printed.
View |  The view to be printed.
Top
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
(Inherited from RevitAPIPreEventArgs)
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSettings |  Get the print settings of the active printing session.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace